#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c74e0d2a-bd3e-46ec-9b04-0249629c5110]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6fc927d9-9245-4aa1-98ef-441e07cb05ef]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73347af8-9d7f-41c6-b41b-57a19bcdd922]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8eaf3833-1600-4c88-add9-733a8db25320]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f4036e5b-1106-4ac4-9830-cba8c1b748a7]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=78a3fbe3-f8de-4d37-a66c-792e6ee66f87]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6a3e3d19-036a-4abd-9b2c-ee1e5094bb51]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=825d9637-9e4c-44d4-a612-153a59b1ab5d]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0946a9f6-b418-434c-979c-a03b865a3597]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bdb011bf-561b-48bb-bda4-dd568280e31f]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ab394989-a8f2-425c-a1e2-2fac53eccb32]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2d7aa8d1-63d1-436b-a556-bfb2702ebbc2]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3571b37c-1181-43d9-b37e-01fbafd92421]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8d8b346b-2428-416c-8a93-46d81fe1624a]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=934f5472-219a-417d-8ec5-8aa7bf64c206]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a784fbba-d62c-4d46-922d-6ed7e7a46f5f]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=978265c6-0494-47e3-843c-8650137a6506]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c3f08da7-36c2-4514-b0d9-624cc4ba7e65]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5464af2a-dee3-41a6-816d-021bf5947753]
module.keycloak_prod.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9c6caa3e-d378-49d4-beb3-0a8ff5b933bf]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=47adddae-1f15-494f-a779-2aa73d2fa5e1]
module.keycloak_prod.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=344a5a18-f7a2-4cdf-a78a-35f92fb1915c]
module.keycloak_prod.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b29e4bc0-21f2-4a7a-908e-26b42c2bef3b]
module.keycloak_prod.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=271d46d9-f2f9-40aa-a96a-252f3095f8b6]
module.keycloak_prod.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ebb9bed4-d3ff-40b2-b352-80bd3b44e179]
module.keycloak_prod.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1bb7f399-93d5-41f2-9745-ed760d9cb8bf]
module.keycloak_prod.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7bc6e36f-a5b6-42b3-9603-755fad9bb661]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=28494fbf-480a-4bbf-bc13-576e074c197d]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=35376788-309c-415e-af27-201f411c880f]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bc415c7a-fce1-4ce5-9916-8b28879ca671]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d1ab7822-ae59-4b13-bec4-b507bd5dd51a]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=02a3db30-2c0e-45e1-965e-bd2f527c30d2]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=aa54bd66-7db0-4edf-aef5-d59c1be7c01a]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5dcccb6-11fc-4959-891f-eb913d465e90]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bfd21928-ceff-4d60-9ed6-9dc7ef047bfd]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6ab9385f-a168-44bc-91ce-e87b1752d677]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d956fb54-754c-42fa-b973-b26a02d4e729]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=93076629-b365-4fbb-876e-d2486b4d2b58]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ea7a1e16-fccc-451c-a4bc-22a73ecbf46b]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bd15d9e2-50ab-412f-abb1-232c69ad5448]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e23c0698-fa49-4129-b20c-57e7340559e4]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=32452579-a9fb-4a16-ad99-b2fe02196651]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c6eaa078-6965-4f29-85c4-28a4e7f9ae27]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e6e98bf3-929b-450b-a98f-82cd47b03fba]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=29c4eb8c-6ac2-425c-8c9d-fd8b16e5f4ba]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=eab68a5f-0f4e-4654-bcb6-7220ffdd74ee]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7009c9cc-54d1-45b9-bc67-a3d25cf42dd5]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80405ebd-d65b-468e-9d1a-a34ac95b141f]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29f047e8-c730-4351-bfc6-b52f399dd9ea]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5d7cadfd-655e-4556-8125-b5602bbc125c]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=889351bc-7326-4f44-aad5-ec5fd45ad099]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8840b1e0-5dda-465f-addb-bf87901f6848]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=86d6bd6c-b64f-4bc4-ab32-fe4a218edf1f]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3d25a5b8-9836-4b23-9366-2a7905eb826c]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f940b209-96bc-4f4b-8ce9-ad0710f5848f]
module.keycloak_test.module.onestopauth_both.module.client_ux-testing-session-2021-11-03-925.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4f23b9ad-b61a-40ae-be23-f9128e13ecef]
module.keycloak_test.module.onestopauth_both.module.client_ux-testing-session-2021-11-03-925.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3c4d4e2c-c281-4cf2-ad1d-b3026b88e19e]
module.keycloak_test.module.onestopauth_both.module.client_ux-testing-session-2021-11-03-925.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=de955e3c-14a5-4f84-aa8f-96d9fc3e403c]
module.keycloak_test.module.onestopauth_both.module.client_ux-testing-session-2021-11-03-925.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8fcd924c-d4bc-4a06-bf83-d8216fd37766]
module.keycloak_test.module.onestopauth_both.module.client_ux-testing-session-2021-11-03-925.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=45b01cde-f52f-4256-b5a3-f29427737417]
module.keycloak_test.module.onestopauth_both.module.client_ux-testing-session-2021-11-03-925.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6ccb806a-c30e-4407-b007-84e05a977ed5]
module.keycloak_test.module.onestopauth_both.module.client_ux-testing-session-2021-11-03-925.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=827a36a2-7471-4876-929a-7ff4a1c3fe36]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=57e94e4b-a570-4da4-8319-8a7c45f0161e]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5e002650-df1f-49b0-b4f8-896bacb58cc2]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=39169a1e-dabb-4b55-9c1e-5bbeb5fe214f]
module.keycloak_prod.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=125f22eb-9665-4b62-9311-39741675b2c1]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=11f414ef-3e8f-4c2b-8379-4bc85f8d2051]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5eac6ffe-edd5-4b0f-887f-f3961dd7b309]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=10640e32-166c-4d34-b9d6-312cb9a64c93]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4d07445e-2736-4131-a023-7d6808d7acff]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8e10db56-a232-499a-b811-16d6e03b1125]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e0138bac-0504-4d25-b77e-53df51d31277]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5aa5ebed-497c-42a5-b8be-518ba04f74ca]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=83941374-268e-41af-8643-19483553efb7]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a4646600-ef19-485f-b978-1cb5eab28063]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=afc863f4-da62-48fc-b1c6-1adac3a63f11]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4e5fbf91-f869-4c32-ae04-01c0014fa99c]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fb58d49-7dec-4bfd-95af-ac495e2ce6d8]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9cdc2c58-be72-401c-89bd-6d066e6c5ae9]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5ebd60e4-a682-47ff-b191-4b789adf95f6]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_role.client_role["bceid-approver"]: Refreshing state... [id=a6bebcae-5a6a-44f9-8f98-5b2a99d281d0]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_role.client_role["sso-admin"]: Refreshing state... [id=7573518c-3197-40f0-b553-16d57112c5fc]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3f6f4d94-f380-4493-8bd3-4d6f4a91897e]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a298f52a-d114-49f5-b650-c50b656ca4a6]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bced4142-2101-4cf4-a128-5880ad0df3cd]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=16b42c20-54db-4b49-94fb-bce3fd911c16]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f0808d6b-4266-4b88-8f1d-b1015ea17b71]
module.keycloak_prod.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=55565b54-22a0-4632-a979-f5dfa9517c8f]
module.keycloak_prod.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c73f9741-142e-4685-b547-9eefca1ecb7f]
module.keycloak_prod.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7785d91c-e110-473d-9b73-ac4ac6ee76c9]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0785f4b7-766a-44cb-b1fd-65adb6962219]
module.keycloak_prod.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=643aef0f-947f-49c5-a444-78c740d920e2]
module.keycloak_prod.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b2716354-cced-4a50-b1d2-7bba43aeaf9b]
module.keycloak_prod.module.onestopauth.module.client_grad-826.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cf1924f3-45d2-4a1d-950c-475948e20eca]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e556d93f-00bf-43b2-a8ea-4271ceca49ae]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8018b07c-9885-4627-9357-dd02d7942553]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=12875dd8-82e1-47df-84a1-2f69914ed41d]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a87bd1e-672c-4951-87a4-0fe8ba39874a]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2cbcd95a-59a1-4ec0-a026-7e6696f73065]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=49a7b096-a394-4977-871c-f82ed3e18bc5]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0518c07f-9ead-4916-824c-659f1308faaa]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=95a7435e-5034-4492-aebc-dcc4ee41a770]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ce032226-6a7b-435d-9a50-8143f672c7f7]
module.keycloak_prod.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e7ffaa1e-58a8-4436-9e0b-0abd0ad5e4cc]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e0bdcd5a-5d9e-4a09-aa15-26398a69f91e]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d1a8a9cb-6b99-4a85-bb92-fe72bd201a4a]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d11cb4ad-87e7-4695-90bf-96993f9ee3f6]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a0c526ee-ad85-40b2-b55f-f3c1fec76376]
module.keycloak_prod.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0d6eafb5-48fe-4ccf-ae03-e4bd74958dd2]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=735825ff-1d35-4f5e-a386-925b19d5a959]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources-496.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7a3e8e86-2665-430d-a6b5-c7af889b84b7]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=98f6e308-ad01-499a-8ab3-658e86abea54]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=adae4615-dc92-47ad-b8c1-bab1cdec130a]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=16585048-0468-4659-82cb-554c6bc34651]
module.keycloak_prod.module.onestopauth.module.client_clean-transportation-data-hub-595.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f6cd61d3-681a-4684-9dcb-d5736e662c3f]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=571bbc1b-8e5b-4ee2-8fcd-1936113dbca6]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1086f4a1-9bd0-4955-8e0b-082db64e4d57]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3269e1c7-bab7-4b20-99f9-e8e993214dcb]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=72cd06b9-1012-4eef-8a53-c2f8f5e3368a]
module.keycloak_prod.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=469f7f33-8fc7-4daf-b210-8700bff04e1e]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4ff00512-dc13-4356-8e0f-8fee2715ce0e]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b04206d6-d37b-44c9-b76e-2cbddec96ded]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c32ad305-13ab-44bd-83c6-f1d1cb5f4525]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e71af3b2-7fff-46ec-b395-654d515095b7]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a872eecf-9d54-4c1a-9700-d3773bc68c47]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cfc7b2f4-69dd-4b01-a3cc-bb82a0b1ef3f]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7e2ffc5a-d75c-4af8-ad2f-0e615a9b6cc9]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b15c5c8e-c382-478c-9379-d57e77624cf1]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=22ec2e68-45c5-4bd7-9b2b-af287323ad6c]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d9bb0cba-9618-4047-965d-ed18f14a782e]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f6c1c5a7-9c27-4c87-8e5e-516fdc06628e]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=458db92f-9bcf-4719-a3d7-1b3d02c0fbc5]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d2fbe100-8bec-4b02-a900-f92042513ac3]
module.keycloak_prod.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=be74f767-aa36-4661-800f-0afc22fe1f44]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3b6e76c9-9083-4d86-9ceb-9580c2eda649]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b03898ff-4879-4215-8a48-14c1a5a1d403]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3e106a58-cf5c-40bd-b8d8-f6442eddbb6c]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c0560048-7b7c-4259-8ce3-dfee0d977ce5]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=63937871-a3e2-418d-aee6-947ccafeabe2]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c0a7a2a-332c-4d7b-82d3-70a8d91c02be]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=93ce7085-7fbe-4fed-b401-1660f3de7ab3]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=aa6681ca-aa63-4fab-93a4-5297ec667657]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=77eec50e-f6ca-48cc-8c8d-6efc4a588bb7]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2ebc2145-eccd-40ae-8dd3-d65ec813c855]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=753fae22-08a1-40e1-b798-0594a06fa2ce]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=837635b3-fc3a-4442-9148-451f1b74ca55]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=be0aa06a-ee89-4e78-adc5-0c8cbb00f12e]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6bfab1cc-4a36-47ba-be77-8961227d6ad6]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=da463c3a-7fc4-4e5f-90d6-e03a4946da02]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9756b434-edb2-4832-ae66-9ae6ff151813]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b5da28e3-5058-4f67-b8bc-9eb1069c3b70]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=89e313ab-659f-46c1-b704-353f46538c79]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f5f8aced-9b81-4ec4-92c8-7bcecc81173b]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f7a14091-fadc-44a9-9a9a-8db49255c592]
module.keycloak_prod.module.onestopauth.module.client_grad-793.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2396fa77-481d-4bc4-a341-fa515d68c045]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f107c290-9760-4f9f-864d-5d136feb4c68]
module.keycloak_prod.module.onestopauth.module.client_grad-793.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dcb44284-5171-410c-93a1-2b799aeb6384]
module.keycloak_prod.module.onestopauth.module.client_grad-793.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c33ec441-6284-4426-8a36-d49f5b274363]
module.keycloak_prod.module.onestopauth.module.client_grad-793.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=78a592fd-b921-4cb8-a0be-80ba546d6713]
module.keycloak_prod.module.onestopauth.module.client_grad-793.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=16056232-9bd7-4393-9397-c446cd013807]
module.keycloak_prod.module.onestopauth.module.client_grad-793.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2df1f422-c2be-4799-917e-296dcfcbca9e]
module.keycloak_prod.module.onestopauth.module.client_grad-793.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6a32fafb-75f6-4832-aa69-b137fe578c27]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "jsb-csrs-991"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "jsb-csrs-991"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "jsb-csrs-991"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "jsb-csrs-991"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://localhost:8080",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "jsb-csrs-991"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "jsb-csrs-991"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "jsb-csrs-991"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "jsb-csrs-991"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://localhost:8080",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 454 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*